#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-003ab38d467d381a2]
module.ecs.aws_ecs_task_definition.taskdef: Refreshing state... [id=ecs-demo]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:cluster/machamp-staging-cluster]
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=machamp-repository]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle: Refreshing state... [id=machamp-repository]
module.network.aws_route_table.public: Refreshing state... [id=rtb-0f61f4069303763f6]
module.network.aws_subnet.public["ap-northeast-1c"]: Refreshing state... [id=subnet-0251d8b2ca9fbb547]
module.ecs_service_sg.aws_security_group.sg: Refreshing state... [id=sg-009e81e8649ab72ea]
module.network.aws_subnet.public["ap-northeast-1a"]: Refreshing state... [id=subnet-0a454fd4250915704]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-03214d8ce5ec2d011]
module.https_sg.aws_security_group.sg: Refreshing state... [id=sg-08cd0365cd608cf95]
module.network.aws_subnet.private["ap-northeast-1a"]: Refreshing state... [id=subnet-0bd16c96b099054f7]
module.network.aws_subnet.private["ap-northeast-1c"]: Refreshing state... [id=subnet-0a178f17eb8a627a8]
module.http_sg.aws_security_group.sg: Refreshing state... [id=sg-02c97baa63c0b1b47]
module.ecs_service_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-485755171]
module.ecs_service_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4093758797]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2173578850]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-916444831]
module.network.aws_route.public: Refreshing state... [id=r-rtb-0f61f4069303763f61080289494]
module.network.aws_route_table_association.public["ap-northeast-1a"]: Refreshing state... [id=rtbassoc-0e8178c6844e9402b]
module.network.aws_route_table_association.public["ap-northeast-1c"]: Refreshing state... [id=rtbassoc-03543bd185ad6a7dd]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2319912217]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-283876636]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/c6410d73568769ca]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/c2e50e43bb6a796f]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/c6410d73568769ca/425e95cc43406c98]
module.ecs.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:service/machamp-staging-cluster/machamp-staging-service]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.service must be replaced
-/+ resource "aws_ecs_service" "service" {
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ap-northeast-1:762742784206:service/machamp-staging-cluster/machamp-staging-service" -> (known after apply)
        name                               = "machamp-staging-service"
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:762742784206:task-definition/ecs-demo:4" -> (known after apply)
        # (11 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer { # forces replacement
          - container_name   = "nginx" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/c2e50e43bb6a796f" -> null
        }
      + load_balancer { # forces replacement
          + container_name   = "rails"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/c2e50e43bb6a796f"
        }

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_task_definition.taskdef must be replaced
-/+ resource "aws_ecs_task_definition" "taskdef" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:762742784206:task-definition/ecs-demo:4" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu          = 0 -> null
                  - environment  = [] -> null
                  ~ image        = "nginx:latest" -> "762742784206.dkr.ecr.ap-northeast-1.amazonaws.com/machamp-repository:latest"
                  - mountPoints  = [] -> null
                  ~ name         = "nginx" -> "rails"
                  ~ portMappings = [
                      ~ {
                          - hostPort      = 80 -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - volumesFrom  = [] -> null
                    # (1 unchanged element hidden)
                } # forces replacement,
            ]
        )
      ~ family                   = "ecs-demo" -> "staging" # forces replacement
      ~ id                       = "ecs-demo" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>